app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT 1  [["user_id", 96]]
---
		<%= render 'follow_form' if signed_in? %>
		<% if @user.microposts.any? %>